Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
/*
void getParamsEEPROM() {
   Serial.printf_P(PSTR("%s\n"), "Загрузка настроек из EEPROM");
   uint8_t address = 0;
   //    uint8_t szLed = sizeof(ledDescription_t);
   // uint8_t szDoser = sizeof(doser_t);
   //   ledDescription_t ledFromEEPROM;

       for (auto& led : leds) {
           eeprom.eeprom_read<ledDescription_t>(address, &led);
           // led.led.off = Alarm.alarmRepeat(led.led.HOff, led.led.MOff, 0, ledOffHandler, led);
           // led.led.on = Alarm.alarmRepeat(led.led.HOn, led.led.MOn, 0, ledOnHandler, led);

           if (shouldRun(led)) {
               // ledOnHandler(led);
           } else {
               // ledOffHandler(led);
           }
           address += szLed + 1;
       }

    //    address -= szLed;
    for (auto& doser : dosersArray) {
         eeprom.eeprom_read<doser_t>(address, &doser);
         doser.alarm = Alarm.alarmRepeat(doser.hour, doser.minute, 0, doserOnHandler, doser);
         // TODO проверить событие не выполнялось ли уже хотя это чтение настроек
         address += szDoser + 1;
     }

    // address -= szDoser;
    // eeprom.eeprom_read<ledDescription_t>(address, &compressor);
     compressor.led.on = Alarm.alarmRepeat(compressor.led.HOn, compressor.led.MOn, 0, compressorOnHandler, compressor);
     compressor.led.off = Alarm.alarmRepeat(compressor.led.HOff, compressor.led.MOff, 0, compressorOffHandler, compressor);

     if (shouldRun(compressor)) {
         compressorOnHandler(compressor);
     } else {
         compressorOffHandler(compressor);
     }
}
void setParamsEEPROM() {
    Serial.printf_P(PSTR("%s\n"), "Запись настроек в EEPROM");
    uint8_t address = 0;
    //    uint8_t szLed = sizeof(ledDescription_t);
    // uint8_t szDoser = sizeof(doser_t);

    for (auto& led : leds) {
         eeprom.eeprom_write<ledDescription_t>(address, led);
         address += szLed + 1;
     }
    //  address -= szLed;
    for (auto& doser : dosersArray) {
        eeprom.eeprom_write<doser_t>(address, doser);
        address += szDoser + 1;
    }
    // address -= szDoser;
    //    eeprom.eeprom_write<ledDescription_t>(address, compressor);
}
*/
void getParamsBackEnd() {
    Serial.printf_P(PSTR("%s"), F("Чтение параметров из облака\n"));
    getParamLights();
    getParamCompressor();
    getParamFlow();
    getParamCO2();
    getParamDosers();
    getParamHeater();
    getParamPump();
    getParamSonics();
    /*
    // TODO сделать сохранение в EEPROM
    setParamsEEPROM();
    */
}

void initLocalClock() {
    configTime(0, 0, ntpServerName);
    setenv("TZ", "MSK-3", 1);
    tzset();
}

void initDS3231() {
    clockRTC.begin();
    char* df = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    Serial.printf_P(PSTR("%s%s\n"), F("Время DS3231: "), String(df).c_str());
    delPtr(df);
}

void sendNTPpacket(const IPAddress& address) {
    memset(packetBuffer, 0, NTP_PACKET_SIZE);
    packetBuffer[0] = 0b11100011;
    packetBuffer[1] = 0;
    packetBuffer[2] = 6;
    packetBuffer[3] = 0xEC;
    packetBuffer[12] = 49;
    packetBuffer[13] = 0x4E;
    packetBuffer[14] = 49;
    packetBuffer[15] = 52;

    udp.beginPacket(address, 123);
    udp.write(packetBuffer, NTP_PACKET_SIZE);
    udp.endPacket();
}

void syncTime() {
    Serial.printf_P(PSTR("%s%s\n"), F("Синхронизация DS3231/NTP "), ntpServerName);
    udp.begin(2390);
    WiFi.hostByName(ntpServerName, timeServerIP);
    sendNTPpacket(timeServerIP);
    delay(100);
    int cb = udp.parsePacket();
    if (cb == 0) {
        Serial.printf_P(PSTR("%s%s\n"), F(" Нет ответа от сервера времени "), ntpServerName);
        count_sync++;
    } else {
        count_sync = 0;
        Serial.printf_P(PSTR("%s%s\n"), F(" Получен ответ от сервера времени "), ntpServerName);
        udp.read(packetBuffer, NTP_PACKET_SIZE);
        unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
        unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
        unsigned long secsSince1900 = highWord << 16 | lowWord;
        const unsigned long seventyYears = 2208988800UL;
        unsigned long epoch = secsSince1900 - seventyYears;
        // 2 секунды разница с большим братом
        epoch = epoch + 0 + 10800;

        char str[20];
        rtc.dateTimeToStr(str);
        Serial.printf_P(PSTR(" %s\n"), str);
        uint32_t rtcEpoch = rtc.getEpoch();
        Serial.printf_P(PSTR("%s%lu\n"), F(" DS3231: "), rtcEpoch);
        Serial.printf_P(PSTR("%s%lu\n"), F("    NTP: "), epoch);

        if ((rtcEpoch - epoch) > 2) {
            Serial.printf_P(PSTR("%s"), F(" Обновляем DS3231 (разница между эпохами = "));
            if ((rtcEpoch - epoch) > 10000) {
                Serial.printf_P(PSTR(" %s\n"), (epoch - rtcEpoch));
            } else {
                Serial.printf_P(PSTR(" %s\n"), (rtcEpoch - epoch));
            }
            rtc.setEpoch(epoch);
        } else {
            Serial.printf_P(PSTR("%s"), F(" Дата и время DS3231 не требуют синхронизации\n"));
        }
    }
}

void initHTTPClient() {
#ifdef ARDUINO_ARCH_ESP8266
    client->setInsecure();
    bool mfl = client->probeMaxFragmentLength("api.backendless.com", 443, 1024);
    if (mfl) {
        client->setBufferSizes(1024, 1024);
    }
#endif
}

void putUptime(const String& uptime) {
    char* url = getPGMString(urlPutUptime);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = R"({"uptime":")";
        payload += uptime;
        payload += "\"}";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("putUptime() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
        payload.clear();
    } else {
        Serial.printf_P(PSTR("%s"), F("putUptime() -> Невозможно подключиться\n\n"));
    }
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

