Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void uptime() {
    String uptime = uptime_formatter::getUptime();
    Serial.printf_P(PSTR("%s%s\n"), F("Uptime: "), uptime.c_str());
    putUptime(uptime);
}

void lastOnline() {
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    char* url = getPGMString(urlPutLastOnline);
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());

    if (https.begin(*client, String(url))) {
        String payload;
        payload.reserve(50);
        payload = R"({"lastonline":")";
        payload += String(currentTime);
        payload += "\"}";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        payload.clear();
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("lastOnline -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s"), F("lastOnline() -> Невозможно подключиться\n"));
    }
    delPtr(currentTime);
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

void postLog(const std::string& message) {
    time_t timenow = time(nullptr);

    char* url = getPGMString(urlPostLog);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"datetime\": ";
        payload += String(timenow);
        payload += R"(000,"message": ")";
        payload += message.c_str();
        payload += "\"}";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.POST(payload);
        payload.clear();
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("postLog() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s"), F("postLog() -> Невозможно подключиться\n\n"));
    }
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

void postBoot() {
    time_t timenow = time(nullptr);
    char* url = getPGMString(urlPostBoot);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = R"({"datetime":")";
        payload += String(timenow);
        payload += "000";
        payload += "\"}";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.POST(payload);
        payload.clear();
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s %d\n"), F("postBoot() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str(), httpCode);
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s"), F("postBoot() -> Невозможно подключиться\n\n"));
    }
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

void parseJSONUpdateSettings(const String& response, bool& result) {
    const size_t capacity = JSON_ARRAY_SIZE(1) + JSON_OBJECT_SIZE(6) + 110;
    DynamicJsonDocument doc(capacity);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.printf_P(PSTR("%s: %s"), F("Невозможно выполнить парсинг"), err.c_str());
        result = false;
    } else {
        auto array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            result = obj["flag"];
        }
    }
    doc.clear();
}

void putUpdateSettings() {
    char* url = getPGMString(urlPutUpdateSettings);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = R"({"flag":false})";
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        payload.clear();
        (httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)
            ? Serial.printf_P(PSTR("%s"), F("putUpdateSettings() -> Флаг сброшен\n"))
            : Serial.printf_P(PSTR("%s%s\n"), F("putUpdateSettings() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putUpdateSettings() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(aj);
}

bool getUpdateSettings() {
    char* url = getPGMString(urlGetUpdateSettings);
    bool flag = false;
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("getUpdateSettings() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s"), F("getUpdateSettings() -> Невозможно подключиться\n\n"));
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR("%s"), F(" getUpdateSettings() -> Ответ пустой\n"));
    } else {
        parseJSONUpdateSettings(responseString, flag);
        responseString.clear();
    }
    return flag;
}

void timer1() {
    getTime();
    getSensorsTemperature();
    Serial.printf_P(PSTR("\e[1;31m%d\e[1;37m\n"), ESP.getFreeHeap());
    postLog(std::to_string(ESP.getFreeHeap()));
    if (getUpdateSettings()) {
        Serial.printf_P(PSTR("%s\n"), F("Будет выполнено обновление всех параметров"));
        getParamsBackEnd();
        printAllDevices();
        putUpdateSettings();
    }
}

void sendTemperature() {
    char* urlPost = getPGMString(urlPostTemperature);
    char* urlPut = getPGMString(urlPutTemperature);
    char* ct = getPGMString(contentType);
    char* aj = getPGMString(applicationJson);
    String payload;
    String urlPostString = String(urlPost);
    String urlPutString = String(urlPut);
    String ctString = String(ct);
    String ajString = String(aj);

