Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
    const int capacity = JSON_OBJECT_SIZE(5);
    DynamicJsonDocument doc(capacity);
    char* currentTime = clockRTC.dateFormat("d.m.Y H:i:s", clockRTC.getDateTime());

    doc["sensor1"] = static_cast<double>(sensorTemperatureValue1);
    doc["sensor2"] = static_cast<double>(sensorTemperatureValue2);
    doc["time"] = String(currentTime);
    serializeJson(doc, payload);
    doc.clear();
    delPtr(currentTime);

    if (https.begin(*client, urlPostString)) {
        https.addHeader(ctString, ajString);
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("postTemperature() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s"), F("postTemperature() -> Невозможно подключиться\n"));
    }
    https.end();

    if (https.begin(*client, urlPutString)) {
        https.addHeader(ctString, ajString);
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("%s%s\n"), F("putTemperature() -> Ошибка: "), HTTPClient::errorToString(httpCode).c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s"), F("putTemperature() -> Невозможно подключиться\n"));
    }
    https.end();
    payload.clear();
    urlPutString.clear();
    ctString.clear();
    ajString.clear();

    delPtr(ct);
    delPtr(aj);
    delPtr(urlPost);
    delPtr(urlPut);
}

void timer5() {
    uptime();
    lastOnline();
    getSensorsTemperature();
    sendTemperature();
}

void startTimers() {
    Alarm.timerRepeat(300, timer5);
    Alarm.timerRepeat(60, timer1);
    Serial.printf_P(PSTR("%s%d\n"), F("Всего таймеров "), Alarm.count());
}

void setupOTA() {
    ArduinoOTA.onStart([]() { Serial.printf_P(PSTR("%s"), F("Start updating \n")); });
    ArduinoOTA.onEnd([]() { Serial.printf_P(PSTR("%s"), F("\nEnd\n")); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf_P(PSTR("%s%u%%\r"), F("Progress: "), (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf_P(PSTR("%s%u%s"), F("Error["), error, F("]: "));
        if (error == OTA_AUTH_ERROR) {
            Serial.printf_P(PSTR("%s"), F("Auth Failed\n"));
        } else if (error == OTA_BEGIN_ERROR) {
            Serial.printf_P(PSTR("%s"), F("Begin Failed\n"));
        } else if (error == OTA_CONNECT_ERROR) {
            Serial.printf_P(PSTR("%s"), F("Connect Failed\n"));
        } else if (error == OTA_RECEIVE_ERROR) {
            Serial.printf_P(PSTR("%s"), F("Receive Failed\n"));
        } else if (error == OTA_END_ERROR) {
            Serial.printf_P(PSTR("%s"), F("End Failed\n"));
        }
    });
    ArduinoOTA.begin();
}

void setup() {
    Serial.begin(115200);
    Serial.println();
    initDS3231();
    initMediators();
    createDevicesAndScheduler();
    if (!initWiFi()) {
        // getParamsEEPROM();
    } else {
        setupOTA();
        initHTTPClient();
        initLocalClock();
        syncTime();
        postBoot();
        getParamsBackEnd();
        printAllDevices();
    }

    startTimers();
    timer5();
}

void loop() {
    Alarm.delay(100);
    ArduinoOTA.handle();
}

#pragma clang diagnostic pop